[
  [
    "English", 
    "English language", 
    "[[:en:|en]]", 
    4234378, 
    129657, 
    763, 
    "English is a West Germanic language that was first spoken in early medieval England and is now the most widely used language in the world."
  ], 
  [
    "German", 
    "German language", 
    "de", 
    1585992, 
    20931, 
    89, 
    "German (Deutsch [ˈdɔʏtʃ] ( listen)) is a West Germanic language related to and classified alongside English and Dutch."
  ], 
  [
    "Dutch", 
    "Dutch language", 
    "nl", 
    1568516, 
    4646, 
    10, 
    "Dutch ( Nederlands (help·info)) is a West Germanic language and the native language of most of the population of the Netherlands, and about sixty percent of the populations of Belgium and Suriname, the three member states of the Dutch Language Union."
  ], 
  [
    "French", 
    "French language", 
    "fr", 
    1386998, 
    17773, 
    162, 
    "French (le français [lə fʁɑ̃sɛ] ( listen) or la langue française [la lɑ̃ɡ fʁɑ̃sɛz]) is a Romance language spoken as a first language in France, the Romandy region in Switzerland, Wallonia and Brussels in Belgium, Monaco, the provinces of Quebec and New Brunswick (Acadia region) in Canada, the U."
  ], 
  [
    "Italian", 
    "Italian language", 
    "it", 
    1033404, 
    7922, 
    94, 
    "Italian ( italiano (help·info) or lingua italiana) is a Romance language spoken mainly in Europe: Italy, Switzerland, San Marino, Vatican City, by minorities in Malta, Monaco, Croatia, Slovenia, France, Libya, Eritrea, and Somalia, and by expatriate communities in the Americas and Australia."
  ], 
  [
    "Spanish", 
    "Spanish language", 
    "es", 
    1016704, 
    16590, 
    168, 
    "Spanish (español), also called Castilian (castellano  listen (help·info)), is a Romance language that originated in Castile, a region in Spain."
  ], 
  [
    "Russian", 
    "Russian language", 
    "ru", 
    1002601, 
    11844, 
    106, 
    "Russian (ру́сский язы́к, russkij jazyk, pronounced [ˈruskʲɪj jɪˈzɨk] is a Slavic language spoken primarily in Russia, Belarus, Ukraine, Kazakhstan, and Kyrgyzstan."
  ], 
  [
    "Swedish", 
    "Swedish language", 
    "sv", 
    974213, 
    2928, 
    21, 
    "Swedish ( svenska (help·info)) is a North Germanic language, spoken by approximately 10 million people, predominantly in Sweden and parts of Finland, where it has equal legal standing with Finnish."
  ], 
  [
    "Polish", 
    "Polish language", 
    "pl", 
    967547, 
    4757, 
    18, 
    "Polish (język polski, polszczyzna) is a language of the Lechitic subgroup of West Slavic languages, used throughout Poland (being that country's official language) and by Polish minorities in other countries."
  ], 
  [
    "Japanese", 
    "Japanese language", 
    "ja", 
    858311, 
    12001, 
    63, 
    "Japanese (日本語, Nihongo?, [nihõŋgo], [nihõŋŋo]  ( listen)) is an East Asian language spoken by about 125 million speakers, primarily in Japan, where it is the national language."
  ], 
  [
    "Portuguese", 
    "Portuguese language", 
    "pt", 
    781814, 
    5695, 
    110, 
    "Portuguese ( português (help·info) or língua portuguesa [ˈɫĩgwɐ puɾtuˈɣezɐ]) is a Romance language."
  ], 
  [
    "Chinese", 
    "Chinese language", 
    "zh", 
    694714, 
    7496, 
    99, 
    "Chinese (汉语/漢語 Hànyǔ or 中文 Zhōngwén) is a group of related language varieties, several of which are not mutually intelligible, and is variously described as a language or language family."
  ], 
  [
    "Vietnamese", 
    "Vietnamese language", 
    "vi", 
    579406, 
    1118, 
    23, 
    "Vietnamese (tiếng Việt) is the national, official language of Vietnam."
  ], 
  [
    "Ukrainian", 
    "Ukrainian language", 
    "uk", 
    442808, 
    2058, 
    40, 
    "Ukrainian (украї́нська мо́ва ukrayins'ka mova, pronounced [ukrɑˈjɪɲsʲkɑ ˈmɔwɑ]) is a member of the East Slavic subgroup of the Slavic languages."
  ], 
  [
    "Catalan", 
    "Catalan language", 
    "ca", 
    402715, 
    1500, 
    26, 
    "Catalan /ˈkætəlæn/ (autonym: català [kətəˈɫa] or [kataˈɫa]) is a Romance language named for its origins in the historical region of Catalonia in the northeastern part of Spain and adjoining parts of what is now France."
  ], 
  [
    "Norwegian (Bokmål)", 
    "Norwegian (Bokmål) language", 
    "no", 
    380196, 
    1836, 
    28, 
    "Bokmål ([ˈbuːkmɔːl], lit. \"book tongue\") is one of two official written standards for the Norwegian language, the other being Nynorsk."
  ], 
  [
    "Waray-Waray", 
    "Waray-Waray language", 
    "war", 
    377380, 
    62, 
    3, 
    "Waray-Waray (also Waray, Samar-Leyte, and Samarnon) is a language spoken in the provinces of Samar, Northern Samar, Eastern Samar, Biliran, and in the north-east of Leyte Island (surrounding Tacloban) in the Philippines."
  ], 
  [
    "Cebuano", 
    "Cebuano language", 
    "ceb", 
    359336, 
    64, 
    4, 
    "Cebuano, referred to by most of its speakers as Binisaya (or Visayan in English), is an Austronesian language spoken in the Philippines by about 20 million people, mostly in the Central Visayas, most of whom belong to the Bisaya ethnic group."
  ], 
  [
    "Finnish", 
    "Finnish language", 
    "fi", 
    322637, 
    1765, 
    46, 
    "Finnish ( suomi (help·info), or suomen kieli) is the language spoken by the majority of the population in Finland and by ethnic Finns outside Finland."
  ], 
  [
    "Persian", 
    "Persian language", 
    "fa", 
    307792, 
    2396, 
    157, 
    "Persian (Persian: فارسی Fārsi [fɒːɾˈsiː]) is an Iranian language within the Indo-Iranian branch of the Indo-European languages."
  ], 
  [
    "Czech", 
    "Czech language", 
    "cs", 
    265545, 
    2033, 
    39, 
    "Czech (pron.: /ˈtʃɛk/; čeština Czech pronunciation: [ˈt͡ʃɛʃcɪna]) is a West Slavic language with about 12 million native speakers; it is the majority language in the Czech Republic and spoken by Czechs worldwide."
  ], 
  [
    "Hungarian", 
    "Hungarian language", 
    "hu", 
    240342, 
    1925, 
    100, 
    "Hungarian (Hungarian: magyar nyelv  listen (help·info)) is a member of the Finno-Ugric group of the Uralic languages."
  ], 
  [
    "Korean", 
    "Korean language", 
    "ko", 
    239090, 
    1930, 
    81, 
    "Korean (Korean: 한국어/조선말, see below) is the official language of South Korea and North Korea as well as one of the two official languages in China's Yanbian Korean Autonomous Prefecture."
  ], 
  [
    "Arabic", 
    "Arabic language", 
    "ar", 
    229755, 
    3061, 
    237, 
    "Arabic (العربية al-ʻarabīyah [alʕaraˈbijja] ( listen) or عربي/عربى ʻarabī  [ˈʕarabiː] ( listen)) is a name applied to the descendants of the Classical Arabic language of the 6th century AD."
  ], 
  [
    "Romanian", 
    "Romanian language", 
    "ro", 
    225824, 
    1063, 
    87, 
    "Romanian (or Daco-Romanian; obsolete spellings Rumanian, Roumanian; self-designation: română, limba română [ˈlimba roˈmɨnə] ( listen) (\"the Romanian language\") or românește (lit. \"in Romanian\") is a Romance language spoken by around 24 million people as a native language, primarily in Romania and Moldova, and by another 4 million people as a second language."
  ], 
  [
    "Malay", 
    "Malay language", 
    "ms", 
    218599, 
    346, 
    18, 
    "Malay (pron.: /məˈleɪ/; Bahasa Melayu; Jawi script: بهاس ملايو ) is a major language of the Austronesian family."
  ], 
  [
    "Turkish", 
    "Turkish language", 
    "tr", 
    209621, 
    2697, 
    216, 
    "Turkish ( Türkçe (help·info)), also referred to as Istanbul Turkish or Anatolian Turkish, is the most widely-spoken of the Turkic languages, with over 63 million native speakers."
  ], 
  [
    "Indonesian", 
    "Indonesian language", 
    "id", 
    208967, 
    1740, 
    108, 
    "Indonesian (Bahasa Indonesia) is the official language of Indonesia."
  ], 
  [
    "Kazakh", 
    "Kazakh language", 
    "kk", 
    202431, 
    331, 
    7, 
    "Kazakh (also Qazaq, Qazaqşa and variants, natively Қазақ тілі, Qazaq tili, قازاق ٴتىلى‎; pronounced [qɑˈzɑq tɘˈlɘ]) is a Turkic language which belongs to the Kipchak (or Western Turkic) branch of the Turkic languages, closely related to Nogai and Karakalpak."
  ], 
  [
    "Serbian", 
    "Serbian language", 
    "sr", 
    187802, 
    738, 
    63, 
    "Serbian (Serbian Cyrillic: српски, Latin: srpski, pronounced [sr̩̂pskiː]) is a standardized register of the Serbo-Croatian language used by Serbs, mainly in Serbia, Bosnia and Herzegovina (mostly Republika Srpska), Montenegro, Croatia, and Macedonia."
  ], 
  [
    "Slovak", 
    "Slovak language", 
    "sk", 
    183804, 
    571, 
    18, 
    "Slovak ( slovenský jazyk (help·info), slovenčina, not to be confused with slovenski jezik or slovenščina, the native name of the Slovene language), is an Indo-European language that belongs to the West Slavic languages (together with Czech, Polish, Silesian, Kashubian, and Sorbian)."
  ], 
  [
    "Esperanto", 
    "Esperanto language", 
    "eo", 
    180243, 
    409, 
    18, 
    " Esperanto (help·info) is the most widely spoken constructed international auxiliary language."
  ], 
  [
    "Danish", 
    "Danish language", 
    "da", 
    178310, 
    1079, 
    66, 
    "Danish (dansk, pronounced [d̥anˀsɡ̊] ( listen); dansk sprog, [ˈd̥anˀsɡ̊ ˈsb̥ʁɔʊ̯ˀ]) is a North Germanic language spoken by around six million people, principally in the country of Denmark and in the region of Southern Schleswig in northern Germany, where it holds minority language status."
  ], 
  [
    "Lithuanian", 
    "Lithuanian language", 
    "lt", 
    158599, 
    376, 
    18, 
    "Lithuanian (lietuvių kalba) is the official state language of Lithuania and is recognized as one of the official languages of the European Union."
  ], 
  [
    "Basque", 
    "Basque language", 
    "eu", 
    150918, 
    306, 
    21, 
    "Basque (endonym: Euskara, IPA: [eus̺ˈkaɾa]) is the ancestral language of the Basque people, who inhabit the Basque Country, a region spanning an area in northeastern Spain and southwestern France."
  ], 
  [
    "Bulgarian", 
    "Bulgarian language", 
    "bg", 
    147501, 
    756, 
    29, 
    "Bulgarian (български език, pronounced [ˈbɤ̞ɫɡɐrski ɛˈzik]) is an Indo-European language, a member of the Southern branch of the Slavic language family."
  ], 
  [
    "Hebrew", 
    "Hebrew language", 
    "he", 
    146423, 
    2297, 
    248, 
    "Hebrew /ˈhiːbruː/ (עִבְרִית ʿIvrit [ʔivˈʁit] ( listen) or [ʕivˈɾit] ( listen)) is a West Semitic language of the Afroasiatic language family."
  ], 
  [
    "Croatian", 
    "Croatian language", 
    "hr", 
    137483, 
    512, 
    36, 
    "Croatian (hrvatski jezik) is a standardized register of the Serbo-Croatian language used by Croats, principally in Croatia, Bosnia and Herzegovina, the Serbian province of Vojvodina and other neighbouring countries."
  ], 
  [
    "Slovenian", 
    "Slovenian language", 
    "sl", 
    137136, 
    530, 
    20, 
    "Slovene or Slovenian (slovenski jezik or slovenščina, not to be confused with slovenčina, the native name of Slovak) belongs to the group of South Slavic languages."
  ], 
  [
    "Uzbek", 
    "Uzbek language", 
    "uz", 
    122125, 
    84, 
    41, 
    "Uzbek (oʻzbek tili or oʻzbekcha in Latin script; ўзбек тили or ўзбекча in Cyrillic script; اوزبیک تیلی or اوزبیکچه in Arabic script) is a Turkic language and the official language of Uzbekistan."
  ], 
  [
    "Volapük", 
    "Volapük language", 
    "vo", 
    119097, 
    34, 
    15, 
    "Volapük (/ˈvɒləpʊk/; [volaˈpyk]) is a constructed language, created in 1879–1880 by Johann Martin Schleyer, a Roman Catholic priest in Baden, Germany."
  ], 
  [
    "Estonian", 
    "Estonian language", 
    "et", 
    111246, 
    486, 
    31, 
    "Estonian (eesti keel  pronounced [ˈeːsti ˈkeːl] ( listen)) is the official language of Estonia, spoken natively by about 1.1 million people in Estonia and tens of thousands in various migrant communities."
  ], 
  [
    "Hindi", 
    "Hindi language", 
    "hi", 
    105403, 
    210, 
    45, 
    "Hindi, or more precisely Modern Standard Hindi, is a standardised and sanskritised register of the Hindustani language (Hindi-Urdu) that is associated with the Hindu religion."
  ], 
  [
    "Norwegian (Nynorsk)", 
    "Norwegian (Nynorsk) language", 
    "nn", 
    102885, 
    232, 
    20, 
    "Nynorsk, Neo Norwegian or New Norwegian is one of two official written standards for the Norwegian language, the other being Bokmål."
  ], 
  [
    "Galician", 
    "Galician language", 
    "gl", 
    102175, 
    286, 
    19, 
    "Galician /ɡəˈlɪʃən/ or /ɡəˈlɪsi.ən/ (galego IPA: [ɡaˈleɣo]) is a language of the Western Ibero-Romance branch."
  ], 
  [
    "Simple English", 
    "Simple English language", 
    "simple", 
    98950, 
    732, 
    76, 
    null
  ], 
  [
    "Azerbaijani", 
    "Azerbaijani language", 
    "az", 
    94642, 
    381, 
    27, 
    "Azerbaijani or Azeri (Azərbaycanca, Azərbaycan dili) is a language belonging to the Turkic language family, spoken in southwestern Asia by the Azerbaijani people, primarily in the Republic of Azerbaijan (8 million speakers), in northwestern Iran (10 to 12 million speakers) and in the Republic of Georgia, Russia, Turkey and in other countries with a presence of Azerbaijani speakers (6 million speakers)."
  ], 
  [
    "Latin", 
    "Latin language", 
    "la", 
    90473, 
    236, 
    12, 
    "Latin (i/ˈlætɨn/; Latin: lingua latīna; IPA: [ˈlɪŋɡʷa laˈtiːna]) is an ancient Italic language originally spoken by the Italic Latins in Latium and Ancient Rome."
  ], 
  [
    "Greek", 
    "Greek language", 
    "el", 
    87530, 
    732, 
    48, 
    "Greek (ελληνικά [eliniˈka] elliniká or ελληνική γλώσσα [eliniˈci ˈɣlosa] ellinikí glóssa) is an independent branch of the Indo-European family of languages."
  ], 
  [
    "Serbo-Croatian", 
    "Serbo-Croatian language", 
    "sh", 
    81258, 
    216, 
    20, 
    "Serbo-Croatian, or Serbo-Croat, less commonly Bosnian/Croatian/Serbian (BCS), is a South Slavic language and the primary language of Serbia, Croatia, Bosnia and Herzegovina, Montenegro."
  ], 
  [
    "Thai", 
    "Thai language", 
    "th", 
    81081, 
    1012, 
    208, 
    "Thai, or more precisely Siamese or Central Thai, is the national and official language of Thailand and the native language of the Thai people, Thailand's dominant ethnic group."
  ], 
  [
    "Georgian", 
    "Georgian language", 
    "ka", 
    75756, 
    201, 
    38, 
    "Georgian (ქართული ენა, pronounced [kʰartʰuli ɛna]) is the native language of the Georgians and the official language of Georgia, a country in the Caucasus."
  ], 
  [
    "Macedonian", 
    "Macedonian language", 
    "mk", 
    72106, 
    515, 
    0, 
    "Macedonian (македонски јазик, makedonski jazik, pronounced [maˈkɛdɔnski ˈjazik] ( listen)) is a South Slavic language, spoken as a first language by some two million people, principally in the Republic of Macedonia and the Macedonian diaspora, with a smaller number of speakers throughout the transnational region of Macedonia."
  ], 
  [
    "Occitan", 
    "Occitan language", 
    "oc", 
    71969, 
    109, 
    8, 
    "Occitan (English pronunciation: /ˈɒksɪˌtæn/; French: [ɔk.si'tɑ̃]; Occitan: [utsiˈta]), known also as Lenga d'òc by its native speakers (Occitan: [ˈleŋɡɔ ˈðɔ(k)]; French: Langue d'oc), is a Romance language spoken in southern France, Italy's Occitan Valleys, Monaco, and Catalonia's Val d'Aran: the regions sometimes known unofficially as Occitania."
  ], 
  [
    "Newar / Nepal Bhasa", 
    "Newar / Nepal Bhasa language", 
    "new", 
    70069, 
    29, 
    12, 
    "Nepal Bhasa (नेपाल भाषा, Nēpāl bhāṣā, also known as Newāh Bhāy) is one of the major languages of Nepal."
  ], 
  [
    "Piedmontese", 
    "Piedmontese language", 
    "pms", 
    61486, 
    37, 
    2, 
    "Piedmontese (Italian: Piemontese, Piedmontese: Piemontèis) is a Romance language spoken by over 1 million people in Piedmont, northwest Italy."
  ], 
  [
    "Tagalog", 
    "Tagalog language", 
    "tl", 
    61433, 
    113, 
    33, 
    "Tagalog /təˈɡɑːlɒɡ/ (Tagalog: [tɐˈɡaːloɡ]) is an Austronesian language spoken as a first language by a quarter of the population of the Philippines and as a second language by most of the rest."
  ], 
  [
    "Belarusian", 
    "Belarusian language", 
    "be", 
    59512, 
    227, 
    22, 
    "The Belarusian language (беларуская мова, BGN/PCGN: byelaruskaya mova, Scientific: bielaruskaja mova, łac.: biełaruskaja mova), sometimes referred to as White Ruthenian, is the language of the Belarusian people."
  ], 
  [
    "Tamil", 
    "Tamil language", 
    "ta", 
    53429, 
    253, 
    32, 
    "Tamil /ˈtæmɪl/ (தமிழ், tamiḻ, [t̪ɐmɨɻ] ?) is a Dravidian language spoken predominantly by Tamil people of South India and North-east Sri Lanka."
  ], 
  [
    "Haitian", 
    "Haitian language", 
    "ht", 
    53204, 
    30, 
    0, 
    "Haitian Creole (Kreyòl ayisyen; pronounced: [kɣejɔl ajisjɛ̃] French: Créole haïtien), often called simply Creole or Kreyòl, is a language spoken by about twelve million people,[citation needed] which includes virtually the entire population of Haiti and via emigration, by about two to three million speakers residing in the Bahamas, Belize, Canada, Cayman Islands, Cuba, Dominican Republic, France, French Guiana, Guadeloupe, Ivory Coast, Martinique, Puerto Rico, Trinidad and Tobago, the United States, and Venezuela."
  ], 
  [
    "Telugu", 
    "Telugu language", 
    "te", 
    52081, 
    110, 
    13, 
    "Telugu /ˈtɛlʊɡuː/ (తెలుగు telugu, IPA: [t̪el̪uɡu]) is a Dravidian language predominantly spoken in the South Indian state of Andhra Pradesh where it is an official language."
  ], 
  [
    "Belarusian (Taraškievica)", 
    "Belarusian (Taraškievica) language", 
    "be-x-old", 
    49061, 
    159, 
    32, 
    "Taraškievica or Belarusian Classical Orthography ([taraʂˈkʲɛvʲit͡sa]; Belarusian: тарашкевіца, клясычны правапіс) is a variant of the orthography of the Belarusian language, based on the literary norm of the modern Belarusian language, the first normalization of which was made by Branisłaŭ Taraškievič in 1918, and was in official use in Belarus until the Belarusian orthography reform of 1933."
  ], 
  [
    "Welsh", 
    "Welsh language", 
    "cy", 
    48791, 
    100, 
    28, 
    "Welsh (Cymraeg or y Gymraeg, pronounced [kəmˈrɑːɨɡ, ə ɡəmˈrɑːɨɡ]) is a member of the Brythonic branch of the Celtic languages spoken natively in Wales, by some along the Welsh border in England, and in Y Wladfa (the Welsh colony in Chubut Province, Argentina)."
  ], 
  [
    "Latvian", 
    "Latvian language", 
    "lv", 
    48506, 
    269, 
    100, 
    "Latvian (latviešu valoda) is the official state language of Latvia."
  ], 
  [
    "Bosnian", 
    "Bosnian language", 
    "bs", 
    45940, 
    180, 
    149, 
    "Bosnian (bosanski / босански [bɔ̌sanskiː]) is a standardized register of the Serbo-Croatian language, a South Slavic language, used by Bosniaks."
  ], 
  [
    "Albanian", 
    "Albanian language", 
    "sq", 
    45630, 
    218, 
    27, 
    "Albanian (gjuha shqipe [ˈɟuha ˈʃcipɛ] or shqip [ʃcip]) is an Indo-European language spoken by approximately 7.4 million people all over the world, primarily in Albania and Kosovo but also in other areas of the Balkans in which there is an Albanian population, including western Republic of Macedonia, southern Montenegro, Greece and Italy."
  ], 
  [
    "Breton", 
    "Breton language", 
    "br", 
    45630, 
    105, 
    20, 
    "Breton /ˈbrɛtən/ (Brezhoneg) is a Celtic language spoken in Brittany (Breton: Breizh; French: Bretagne), France."
  ], 
  [
    "Armenian", 
    "Armenian language", 
    "hy", 
    45444, 
    199, 
    83, 
    "The Armenian language (Armenian: հայերեն, Armenian pronunciation: [hɑjɛˈɾɛn], hayeren) is an Indo-European language spoken by the Armenians."
  ], 
  [
    "Malagasy", 
    "Malagasy language", 
    "mg", 
    45362, 
    29, 
    32, 
    "Malagasy /mæləˈɡæsi/ (Malagasy: [ˌmalaˈɡasʲ]) is an Austronesian language and the national language of Madagascar."
  ], 
  [
    "Tatar", 
    "Tatar language", 
    "tt", 
    43885, 
    66, 
    10, 
    "Tatar or Kazan Tatar (татар теле, татарча, tatar tele, tatarça, تاتار تيلی) is a Turkic language spoken by the Tatars of the historical Kazan Khanate, including modern Tatarstan and Bashkortostan."
  ], 
  [
    "Javanese", 
    "Javanese language", 
    "jv", 
    43783, 
    84, 
    13, 
    "Javanese /dʒɑːvəˈniːz/ (Javanese: ꦧꦱꦗꦮ basa Jawa; Indonesian: bahasa Jawa) is the language of the Javanese people from the central and eastern parts of the island of Java, in Indonesia."
  ], 
  [
    "Marathi", 
    "Marathi language", 
    "mr", 
    38740, 
    121, 
    53, 
    "Marathi /məˈrɑːti/ (मराठी Marāṭhī [məˈɾaʈʰi]) is an Indo-Aryan language."
  ], 
  [
    "Luxembourgish", 
    "Luxembourgish language", 
    "lb", 
    38672, 
    86, 
    22, 
    "Luxembourgish (Lëtzebuergesch) is a High German language that is spoken mainly in Luxembourg."
  ], 
  [
    "Icelandic", 
    "Icelandic language", 
    "is", 
    35768, 
    158, 
    43, 
    "Icelandic ( íslenska (help·info)) is a North Germanic language, the main language of Iceland."
  ], 
  [
    "Burmese", 
    "Burmese language", 
    "my", 
    31309, 
    49, 
    1, 
    "The Burmese language (Burmese: မြန်မာဘာသာ; pronounced: [mjəmà bàðà]; MLCTS: myanma bhasa) is the official language of Burma."
  ], 
  [
    "Yoruba", 
    "Yoruba language", 
    "yo", 
    30584, 
    35, 
    5, 
    "Yoruba /ˈjɒrʊbə/ (natively èdè Yorùbá) is a Niger–Congo language spoken in West Africa."
  ], 
  [
    "Bashkir", 
    "Bashkir language", 
    "ba", 
    30544, 
    58, 
    8, 
    "The Bashkir language (Башҡорт теле başqort tele, pronounced [baʂ.ˌqʊ̞rt.tɪ̞.ˈlɪ̞] ( listen)) is a Turkic language, and is the language of the Bashkirs."
  ], 
  [
    "Malayalam", 
    "Malayalam language", 
    "ml", 
    30541, 
    293, 
    296, 
    "Malayalam /mæləˈjɑːləm/ (മലയാളം, malayāḷam ?, Malayalam pronunciation: ​[mɐləjaːɭəm]), is a language spoken in India, predominantly in the state of Kerala."
  ], 
  [
    "Aragonese", 
    "Aragonese language", 
    "an", 
    29172, 
    87, 
    85, 
    "Aragonese (pron.: /ˌærəɡɒˈniːz/; aragonés [aɾaɣoˈnes] in Aragonese) is a Romance language spoken by between 10,000 and 30,000 people throughout the valleys of the Pyrenees in Aragon, Spain, mainly in the comarcas of Somontano de Barbastro, Jacetania, Alto Gállego, Sobrarbe, and Ribagorza."
  ], 
  [
    "Lombard", 
    "Lombard language", 
    "lmo", 
    28669, 
    59, 
    32, 
    "Lombard is a member of the Cisalpine or Gallo-Italic group within the Romance languages."
  ], 
  [
    "Afrikaans", 
    "Afrikaans language", 
    "af", 
    26806, 
    150, 
    38, 
    "Afrikaans /æfrɪˈkɑːns/ is a West Germanic language, spoken natively in South Africa, Namibia and to a lesser extent in Botswana and Zimbabwe."
  ], 
  [
    "West Frisian", 
    "West Frisian language", 
    "fy", 
    26497, 
    77, 
    14, 
    "West Frisian (Frysk, Dutch: Westerlauwers Fries [ˈʋɛstərˌlʌu̯ərs ˈfris]) is a language spoken mostly in the province of Friesland (Fryslân) in the north of the Netherlands."
  ], 
  [
    "Western Panjabi", 
    "Western Panjabi language", 
    "pnb", 
    26352, 
    38, 
    0, 
    "Punjabi /pʌnˈdʒɑːbi/ (Gurmukhi: ਪੰਜਾਬੀ, Shahmukhi: پنجابی, Devanagari: पंजाबी) Punjabi is an Indo-Aryan language spoken by inhabitants of the historical Punjab region (India and Pakistan)."
  ], 
  [
    "Bengali", 
    "Bengali language", 
    "bn", 
    26041, 
    288, 
    0, 
    "Bengali /bɛŋˈɡɔːli/ (বাংলা Bangla [ˈbaŋla] ( listen)) is an eastern Indo-Aryan language."
  ], 
  [
    "Swahili", 
    "Swahili language", 
    "sw", 
    25272, 
    62, 
    37, 
    "The Swahili language (Arabic: سواحلي‎), or Kiswahili, is a Bantu language and it is the mother tongue of the Swahili People (Waswahili) spoken in East and Central africa by various ethnic groups that inhabit several large stretches of the Mozambique Channel coastline from northern Kenya to northern Mozambique."
  ], 
  [
    "Bishnupriya Manipuri", 
    "Bishnupriya Manipuri language", 
    "bpy", 
    24800, 
    24, 
    23, 
    "The Bishnupriya or Bishnupriya Manipuri (BPM) (বিষ্ণুপ্রিয়া মণিপুরী) is an Indo-Aryan language spoken in parts of the Indian states of Assam, Tripura and others, as well as in Sylhet region of Bangladesh, Burma, and other countries."
  ], 
  [
    "Ido", 
    "Ido language", 
    "io", 
    24777, 
    51, 
    5, 
    "Ido (pron.: /ˈiːdoʊ/) is a language created to be a universal second language for speakers of diverse backgrounds."
  ], 
  [
    "Kirghiz", 
    "Kirghiz language", 
    "ky", 
    24460, 
    54, 
    1, 
    "Kyrgyz /ˈkɪərɡɪz/ (Kirgiz), also Kirghiz /kɪərˈɡiːz/ (Кыргызча or Кыргыз тили, قىرعىز تىلى, Kırgızça or Kırgız tili) is a language of the Turkic language family and one of the main official languages of Kyrgyzstan, the other one being Russian."
  ], 
  [
    "Urdu", 
    "Urdu language", 
    "ur", 
    24060, 
    78, 
    77, 
    "Urdu pron.: /ˈʊərduː/ (Urdu: اُردُو‎, Urdū, Urdu pronunciation: [ˈʊrd̪u] ( listen)), or more precisely Modern Standard Urdu, is a standardized register of the Hindustani language that is associated with the Muslim religion."
  ], 
  [
    "Nepali", 
    "Nepali language", 
    "ne", 
    23290, 
    75, 
    10, 
    "Nepali (नेपाली) is a language in the Indo-Aryan languages ."
  ], 
  [
    "Sicilian", 
    "Sicilian language", 
    "scn", 
    22970, 
    61, 
    22, 
    "Sicilian (lu sicilianu, Italian: lingua siciliana, also known as Siculu or Calabro-Sicilian) is a Romance language."
  ], 
  [
    "Cantonese", 
    "Cantonese language", 
    "zh-yue", 
    22849, 
    164, 
    54, 
    "Cantonese, or Standard Cantonese (simplified Chinese: 广州话; traditional Chinese: 廣州話), is a language that originated in the vicinity of Canton (i.e., Guangzhou) in southern China, and is often regarded as the prestige dialect of Yue."
  ], 
  [
    "Gujarati", 
    "Gujarati language", 
    "gu", 
    22530, 
    72, 
    5, 
    "Gujarati /ɡʊdʒəˈrɑːti/ (ગુજરાતી Gujarātī) is an Indo-Aryan language, native to Gujarat, Daman and Diu and Dadra and Nagar Haveli in India."
  ], 
  [
    "Low Saxon", 
    "Low Saxon language", 
    "nds", 
    20511, 
    61, 
    31, 
    "Low German or Low Saxon (Plattdüütsch, Nedderdüütsch; Standard German: Plattdeutsch or Niederdeutsch; Dutch: Nedersaksisch in the wider sense."
  ], 
  [
    "Irish", 
    "Irish language", 
    "ga", 
    19677, 
    55, 
    17, 
    "Irish (Gaeilge), also known as Irish Gaelic or Gaelic, is a Goidelic language of the Indo-European language family, originating in Ireland and historically spoken by the Irish people."
  ], 
  [
    "Kurdish", 
    "Kurdish language", 
    "ku", 
    19627, 
    63, 
    25, 
    "Kurdish (Kurdish: Kurdî or کوردی) is a dialect continuum spoken by the Kurds in western Asia."
  ], 
  [
    "Asturian", 
    "Asturian language", 
    "ast", 
    18668, 
    76, 
    15, 
    "Asturian (pron.: /æsˈtʊəriən/; autonym: asturianu [astu'ɾjanu], or bable [ˈbaβle]) is a Romance language of the West Iberian group, Astur-Leonese subgroup, spoken in Asturias (Spain)."
  ], 
  [
    "Quechua", 
    "Quechua language", 
    "qu", 
    18122, 
    35, 
    37, 
    "Quechua (endonym \"Runa Simi\") is a Native South American language family spoken primarily in the Andes of South America, derived from a common ancestral language."
  ], 
  [
    "Sundanese", 
    "Sundanese language", 
    "su", 
    17484, 
    41, 
    14, 
    "Sundanese /sʌndəˈniːz/ (Basa Sunda, in Sundanese script ᮘᮞ ᮞᮥᮔ᮪ᮓ, literally \"language of Sunda\") is the language of about 39 million people from the western third of Java or about 15% of the Indonesian population."
  ], 
  [
    "Chuvash", 
    "Chuvash language", 
    "cv", 
    15566, 
    46, 
    18, 
    "Chuvash (Чӑвашла, Čăvašla; IPA: [tɕəʋaʂˈla]) is a Turkic language spoken in central Russia, primarily in the Chuvash Republic and adjacent areas."
  ], 
  [
    "Scots", 
    "Scots language", 
    "sco", 
    14482, 
    68, 
    42, 
    "Scots is the Germanic language variety spoken in Lowland Scotland and parts of Ulster (where the local dialect is known as Ulster Scots)."
  ], 
  [
    "Alemannic", 
    "Alemannic language", 
    "als", 
    14417, 
    94, 
    29, 
    "Alemannic (German:  Alemannisch (help·info)) is a group of dialects of the Upper German branch of the Germanic language family."
  ], 
  [
    "Interlingua", 
    "Interlingua language", 
    "ia", 
    13978, 
    52, 
    11, 
    "Interlingua (pron.: /ɪntərˈlɪŋɡwə/; ISO 639 language codes ia, ina) is an international auxiliary language (IAL), developed between 1937 and 1951 by the International Auxiliary Language Association (IALA)."
  ], 
  [
    "Neapolitan", 
    "Neapolitan language", 
    "nap", 
    13826, 
    35, 
    22, 
    "Neapolitan (autonym: nnapulitano; Italian: napoletano), also known as Southern Italian and Neapolitan–Calabrian, is the language of southern continental Italy, including the city of Naples."
  ], 
  [
    "Buginese", 
    "Buginese language", 
    "bug", 
    13819, 
    17, 
    1, 
    "Buginese (Basa Ugi, elsewhere also Bahasa Bugis, Bugis, Bugi, De) is the language spoken by about four million people mainly in the southern part of Sulawesi, Indonesia."
  ], 
  [
    "Samogitian", 
    "Samogitian language", 
    "bat-smg", 
    13456, 
    26, 
    8, 
    "Samogitian (Samogitian: Žemaitiu ruoda, Lithuanian: Žemaičių tarmė) is a dialect of the Lithuanian language spoken mostly in Samogitia (in the western part of Lithuania)."
  ], 
  [
    "Kannada", 
    "Kannada language", 
    "kn", 
    13034, 
    131, 
    27, 
    "Kannada /ˈkænədə/, (ಕನ್ನಡ kannaḍa, IPA: [ˈkʌnːəɖɑː]) or Kanarese /kænəˈriːz/, is a language spoken in India predominantly in the state of Karnataka."
  ], 
  [
    "Banyumasan", 
    "Banyumasan language", 
    "map-bms", 
    12993, 
    23, 
    7, 
    "The Banyumasan language, colloquially known as Basa Ngapak, spoken on the island of Java, is usually considered a dialect of Javanese in modern language classification."
  ], 
  [
    "Walloon", 
    "Walloon language", 
    "wa", 
    12803, 
    27, 
    23, 
    "Walloon (Walon in Walloon) is a Romance language that was spoken as a primary language in large portions (70%) of the Walloon Region of Belgium, in some villages of Northern France (near Givet) and in the northeast part of Wisconsin until the middle of the 20th century."
  ], 
  [
    "Amharic", 
    "Amharic language", 
    "am", 
    12445, 
    31, 
    35, 
    "Amharic /æmˈhærɪk/ or /ɑːmˈhɑrɪk/ (Amharic: አማርኛ?, Amarəñña, IPA: [amarɨɲːa] ( listen)) is a Semitic language spoken in Ethiopia."
  ], 
  [
    "Sorani", 
    "Sorani language", 
    "ckb", 
    12160, 
    66, 
    27, 
    "Soranî (کوردیی ناوەندی, سۆرانی; also called Central Kurdish) is a Kurdish dialect spoken in Iran and Iraq."
  ], 
  [
    "Scottish Gaelic", 
    "Scottish Gaelic language", 
    "gd", 
    11478, 
    45, 
    11, 
    "Scottish Gaelic (Gàidhlig; [ˈkaːlikʲ]  listen (help·info)) is a Celtic language native to Scotland."
  ], 
  [
    "Fiji Hindi", 
    "Fiji Hindi language", 
    "hif", 
    11047, 
    40, 
    7, 
    "Fiji Hindi, also known as Fijian Hindi or Fijian Hindustani, is the language spoken by most Fijian citizens of Indian descent, though a small number speak other languages at home."
  ], 
  [
    "Min Nan", 
    "Min Nan language", 
    "zh-min-nan", 
    11007, 
    41, 
    40, 
    "Southern Min, or Min Nan (simplified Chinese: 闽南语; traditional Chinese: 閩南語; pinyin: Mǐnnán Yǔ; Pe̍h-ōe-jī: Bân-lâm-gí/Bân-lâm-gú; literally \"Southern Fujian language\"), are a family of Chinese languages or varieties spoken in parts of China such as southern Fujian, eastern Guangdong, Hainan, and southern Zhejiang, and in Taiwan."
  ], 
  [
    "Tajik", 
    "Tajik language", 
    "tg", 
    10866, 
    45, 
    13, 
    "Tajik, Tajik Persian, or Tajiki, (sometimes written Tadjik or Tadzhik; тоҷикӣ, تاجیکی‎, tojikī [tɔːdʒɪˈkiː]) is a variety of modern Persian spoken in Central Asia."
  ], 
  [
    "Egyptian Arabic", 
    "Egyptian Arabic language", 
    "arz", 
    10405, 
    97, 
    287, 
    "Egyptian Arabic is the language spoken by contemporary Egyptians."
  ], 
  [
    "Mazandarani", 
    "Mazandarani language", 
    "mzn", 
    10382, 
    30, 
    6, 
    "Mazanderani (مازِرونی) or Tabari (تبری) is an Iranian language of the Northwestern branch, spoken mainly in Iran's Mazandaran, Gilan and Golestan provinces."
  ], 
  [
    "Yiddish", 
    "Yiddish language", 
    "yi", 
    10135, 
    55, 
    73, 
    "Yiddish (ייִדיש yidish or אידיש idish, literally \"Jewish\") is a High German language of Ashkenazi Jewish origin, spoken in many parts of the world."
  ], 
  [
    "Venetian", 
    "Venetian language", 
    "vec", 
    10083, 
    47, 
    76, 
    "Venetian or Venetan is a Romance language spoken as a native language by over two million people, mostly in the Veneto region of Italy, where most of the five million inhabitants can understand it."
  ], 
  [
    "Mongolian", 
    "Mongolian language", 
    "mn", 
    9469, 
    253, 
    46, 
    "The Mongolian language (in Mongolian script: , Mongɣol kele; in Mongolian Cyrillic: Монгол хэл, Mongol khel) is the official language of Mongolia and the best-known member of the Mongolic language family."
  ], 
  [
    "Nahuatl", 
    "Nahuatl language", 
    "nah", 
    9203, 
    34, 
    22, 
    "Nahuatl /ˈnɑːwɑːtəl/ (Nahuatl pronunciation: [ˈnaːwatɬ] ( listen)[cn 1]) is a language of the Nahuan branch of the Uto-Aztecan language family."
  ], 
  [
    "Tarantino", 
    "Tarantino language", 
    "roa-tara", 
    9173, 
    24, 
    5, 
    "Tarantino of the southeastern Italian region of Apulia is a dialect of Southern Italian / Sicilian."
  ], 
  [
    "Sakha", 
    "Sakha language", 
    "sah", 
    9041, 
    29, 
    41, 
    "Sakha, or Yakut, is a Turkic language with around 360,000 native speakers spoken in the Sakha Republic in the Russian Federation by the Sakha or Yakuts."
  ], 
  [
    "Sanskrit", 
    "Sanskrit language", 
    "sa", 
    9027, 
    41, 
    22, 
    "Sanskrit (संस्कृतम् saṃskṛtam [sə̃skɹ̩t̪əm], originally संस्कृता वाक् saṃskṛtā vāk, \"refined speech\") is a historical Indo-Aryan language, the primary liturgical language of Hinduism and a literary and scholarly language in Buddhism and Jainism."
  ], 
  [
    "Ossetian", 
    "Ossetian language", 
    "os", 
    8942, 
    37, 
    104, 
    "Ossetic or Ossetian (Ossetic: Ирон, tr."
  ], 
  [
    "Kapampangan", 
    "Kapampangan language", 
    "pam", 
    7795, 
    34, 
    22, 
    "The Kapampangan language, Pampango, or Pampangan [ˌkapamˈpaŋan], is one of the major languages of the Philippines."
  ], 
  [
    "Upper Sorbian", 
    "Upper Sorbian language", 
    "hsb", 
    7735, 
    38, 
    37, 
    "Upper Sorbian (Hornjoserbšćina) is a minority language spoken by Sorbs in Germany in the historical province of Upper Lusatia (Hornja Łužica in Sorbian), which is today part of Saxony."
  ], 
  [
    "Sinhalese", 
    "Sinhalese language", 
    "si", 
    7644, 
    57, 
    116, 
    "Sinhala (සිංහල siṁhala [ˈsiŋɦələ]), also known as Sinhalese /sɪnəˈliːz/, is the mother tongue of the Sinhalese people, who make up the largest ethnic group in Sri Lanka, numbering about 16 million."
  ], 
  [
    "Northern Sami", 
    "Northern Sami language", 
    "se", 
    7471, 
    26, 
    22, 
    "Northern or North Sami (Davvisámegiella, formerly Davvisámi or Davvisaami; disapproved exonym Lappish or Lapp) is the most widely spoken of all Sami languages."
  ], 
  [
    "Bavarian", 
    "Bavarian language", 
    "bar", 
    7363, 
    76, 
    100, 
    "Bavarian (German:  Bairisch (help·info), Austro-Bavarian: Boarisch, IPA: /bɔɑrɪʃ/), is a major group of Upper German varieties spoken in the southeast of the German language area, largely covered by Bavaria and Austria."
  ], 
  [
    "Limburgish", 
    "Limburgish language", 
    "li", 
    7274, 
    42, 
    71, 
    "Limburgish, also called Limburgian or Limburgic (Limburgish: Lèmbörgs [ˈlem.bœrxs] Dutch: Limburgs [ˈlɪm.bʏrxs], German: Limburgisch [ˈlɪm.buɐ.ɡɪʃ], French: Limbourgeois [ˈlɛ̃.buʁ.ʒwa]) is a group of East Low Franconian language varieties spoken in the Limburg and Rhineland regions, along the Dutch-Belgian-German border."
  ], 
  [
    "Maori", 
    "Maori language", 
    "mi", 
    7030, 
    24, 
    7, 
    "Māori /ˈmaʊri/, or Maori Te Reo Māori [ˈmaːɔɾi, tɛ ˈɾɛɔ ˈmaːɔɾi], commonly Te Reo (\"The language\"), is the language of the indigenous population of New Zealand, the Māori."
  ], 
  [
    "Corsican", 
    "Corsican language", 
    "co", 
    6482, 
    33, 
    24, 
    "Corsican (corsu or lingua corsa) is an Italo-Dalmatian Romance language spoken and written on the islands of Corsica (France) and northern Sardinia (Italy)."
  ], 
  [
    "Ilokano", 
    "Ilokano language", 
    "ilo", 
    6147, 
    26, 
    41, 
    "Ilokano (Ilocano) /iːloʊˈkɑːnoʊ/ (Ilocano: Ti Pagsasao nga Iloco) is the third most-spoken language of the Republic of the Philippines."
  ], 
  [
    "Gan", 
    "Gan language", 
    "gan", 
    6127, 
    30, 
    227, 
    "Gàn (simplified Chinese: 赣语; traditional Chinese: 贛語; Gan: Gon ua), alternatively Jiangxinese (Chinese: 江西话 Jiāngxī huà; Gan: Kongsi ua) is spoken as the native language by around 50 million people in the Jiangxi province of China, as well as significant populations in surrounding regions such as Hunan, Hubei, Anhui and Fujian."
  ], 
  [
    "Faroese", 
    "Faroese language", 
    "fo", 
    6108, 
    39, 
    52, 
    "Faroese (in Faroese: føroyskt, pronounced [ˈføːɹɪst]) is an Insular Nordic language spoken as a native language by about 70,000–75,000 people, 45,000 of which reside on the Faroe Islands and 25,000–30,000[citation needed] in other areas, mainly mainland Denmark."
  ], 
  [
    "Tibetan", 
    "Tibetan language", 
    "bo", 
    6062, 
    43, 
    19, 
    null
  ], 
  [
    "Punjabi", 
    "Punjabi language", 
    "pa", 
    6033, 
    50, 
    32, 
    "Punjabi /pʌnˈdʒɑːbi/ (Gurmukhi: ਪੰਜਾਬੀ, Shahmukhi: پنجابی, Devanagari: पंजाबी) Punjabi is an Indo-Aryan language spoken by inhabitants of the historical Punjab region (India and Pakistan)."
  ], 
  [
    "Gilaki", 
    "Gilaki language", 
    "glk", 
    6013, 
    20, 
    3, 
    "The Gilaki language is a Caspian language, and a member of the northwestern Iranian language branch, spoken in Iran's Gīlān Province."
  ], 
  [
    "Rusyn", 
    "Rusyn language", 
    "rue", 
    5940, 
    17, 
    2, 
    "Rusyn (Rusyn: русиньска бесїда or русиньскый язык), also known in English as Ruthene (sometimes Ruthenian), is an East Slavic language variety spoken by the Rusyns of Central Europe."
  ], 
  [
    "Central_Bicolano", 
    "Central Bicolano language", 
    "bcl", 
    5609, 
    26, 
    9, 
    "Central Bikol is the most-spoken language in the Bicol region of southern Luzon, Philippines."
  ], 
  [
    "Võro", 
    "Võro language", 
    "fiu-vro", 
    5111, 
    31, 
    11, 
    "The Võro language (Võro: võro kiil, Estonian: võru keel) is a language belonging to the Finnic branch of the Uralic languages."
  ], 
  [
    "Hill Mari", 
    "Hill Mari language", 
    "mrj", 
    5107, 
    16, 
    4, 
    "Hill Mari or Western Mari (Мары йӹлмӹ) is a language spoken in the Gornomariysky, Yurinsky and Kilemarsky districts of Mari El, Russia."
  ], 
  [
    "Dutch Low Saxon", 
    "Dutch Low Saxon language", 
    "nds-nl", 
    5093, 
    42, 
    64, 
    "Dutch Low Saxon (Dutch Low Saxon and Dutch: Nedersaksisch) is a group of Low Saxon, i.e., West Low German, dialects spoken in the northeastern Netherlands."
  ], 
  [
    "Turkmen", 
    "Turkmen language", 
    "tk", 
    4768, 
    31, 
    29, 
    "Turkmen (türkmençe, türkmen dili, Cyrillic: түркменче, түркмен дили, Persian: تورکمن ﺗﻴﻠی, تورکمنچه), a Turkic language, is the national language of Turkmenistan."
  ], 
  [
    "Pashto", 
    "Pashto language", 
    "ps", 
    4718, 
    27, 
    31, 
    "Pashto (پښتو pax̌to, IPA: [paʂˈto, paçˈto, puxˈto]; alternatively spelled Pakhto, Pushto or Pukhto), also known historically as Afghani (افغاني afǧānī) and Pathani, is the native language of the Pashtun people of South-Central Asia."
  ], 
  [
    "West Flemish", 
    "West Flemish language", 
    "vls", 
    4662, 
    26, 
    85, 
    "West Flemish (Dutch: West-Vlaams, French: flamand occidental, West Flemish: West-Vlams/West-Vloams), \"Flemish\" in the linguistic sense, is a language spoken in western Belgium and adjoining parts of the Netherlands and France."
  ], 
  [
    "Mingrelian", 
    "Mingrelian language", 
    "xmf", 
    4602, 
    24, 
    32, 
    "Mingrelian, or Megrelian (მარგალური ნინა margaluri nina) is a Kartvelian language spoken in Western Georgia (regions of Samegrelo and Abkhazia), primarily by Mingrelians."
  ], 
  [
    "Manx", 
    "Manx language", 
    "gv", 
    4515, 
    22, 
    131, 
    "Manx (native name Gaelg or Gailck, pronounced [ɡilk] or [ɡilɡ]), also known as Manx Gaelic, and as the Manks language, is a Goidelic language of the Indo-European language family, historically spoken by the Manx people."
  ], 
  [
    "Zazaki", 
    "Zazaki language", 
    "diq", 
    4116, 
    42, 
    206, 
    "Zazaki, also called Zaza, Kirmanjki, Kirdki and Dimli, is an Indo-European language spoken primarily in eastern Turkey."
  ], 
  [
    "Oriya", 
    "Oriya language", 
    "or", 
    3920, 
    41, 
    146, 
    "Oriya (ଓଡ଼ିଆ oṛiā), officially spelled Odia is an Indian language, belonging to the Indo-Aryan branch of the Indo-European language family."
  ], 
  [
    "Komi", 
    "Komi language", 
    "kv", 
    3864, 
    19, 
    24, 
    "The Komi language (in Komi: Коми кыв, transliteration: Komi kyv [komi kɨv]) is a Uralic language spoken by the Komi peoples in the northeastern European part of Russia."
  ], 
  [
    "Pangasinan", 
    "Pangasinan language", 
    "pag", 
    3846, 
    14, 
    3, 
    "The Pangasinan language (Pangasinan: Salitan Pangasinan; Spanish: Idioma pangasinense) is an Austronesian language, which is one of the twelve major languages in the Philippines."
  ], 
  [
    "Zeelandic", 
    "Zeelandic language", 
    "zea", 
    3740, 
    25, 
    8, 
    "Zeelandic (Zeêuws in Zeelandic, Zeeuws in Dutch) is a regional language spoken in the Dutch province of Zeeland and on the South Holland island of Goeree-Overflakkee."
  ], 
  [
    "Khmer", 
    "Khmer language", 
    "km", 
    3737, 
    58, 
    123, 
    "Khmer /kəˈmɛər/ (ភាសាខ្មែរ, IPA: [pʰiːəsaː kʰmaːe]; or more formally, ខេមរភាសា, IPA: [kʰeɛmaʔraʔ pʰiːəsaː]), or Cambodian, is the language of the Khmer people and the official language of Cambodia."
  ], 
  [
    "Divehi", 
    "Divehi language", 
    "dv", 
    3658, 
    25, 
    40, 
    "Maldivian (ދިވެހި Divehi), is an Indo-Aryan language predominantly spoken by about 350,000 people in the Maldives where it is the national language."
  ], 
  [
    "Norman", 
    "Norman language", 
    "nrm", 
    3545, 
    17, 
    39, 
    "Norman (Normandy: Nourmaund, Guernésiais: Normand, Jèrriais: Nouormand) is a Romance language and one of the Oïl languages."
  ], 
  [
    "Meadow Mari", 
    "Meadow Mari language", 
    "mhr", 
    3440, 
    26, 
    55, 
    "Meadow Mari or Eastern Mari is a standardized dialect of the Mari language used by about half a million people mostly in the European part of the Russian Federation."
  ], 
  [
    "Romansh", 
    "Romansh language", 
    "rm", 
    3432, 
    32, 
    31, 
    "Romansh (also spelled Romansch, Rumants(c)h, or Romanche; Romansh:  rumantsch (help·info)/ rumauntsch (help·info)/ romontsch (help·info)/rumàntsch; German: Rätoromanisch; Italian: Romancio) is a Rhaeto-Romance language descended from the Vulgar Latin spoken by the Roman era occupiers of the region."
  ], 
  [
    "Komi-Permyak", 
    "Komi-Permyak language", 
    "koi", 
    3427, 
    15, 
    9, 
    "Komi-Permyak language (перем коми кыв /ˈperem ˈkomi kɨv/ or коми-пермяцкӧй кыв /ˈkomi perˈmʲackəj kɨv/) is one of two regional varieties of the pluricentrical Komi language, the other variety being Komi-Zyrian."
  ], 
  [
    "Udmurt", 
    "Udmurt language", 
    "udm", 
    3369, 
    37, 
    23, 
    "Udmurt (удмурт кыл, udmurt kyl) is an Uralic language, part of the Permic subgroup, spoken by the Udmurt natives of the Russian constituent republic of Udmurtia, where it is coofficial with Russian."
  ], 
  [
    "Kashubian", 
    "Kashubian language", 
    "csb", 
    3324, 
    22, 
    23, 
    "Kashubian or Cassubian (Kashubian: kaszëbsczi jãzëk, pòmòrsczi jãzëk, kaszëbskò-słowińskô mòwa; Polish: język kaszubski, język pomorski, język kaszubsko-słowiński) is one of the Lechitic languages, a subgroup of the Slavic languages."
  ], 
  [
    "North Frisian", 
    "North Frisian language", 
    "frr", 
    3312, 
    17, 
    43, 
    "North Frisian is a minority language of Germany, spoken by about 10,000 people in North Frisia."
  ], 
  [
    "Vepsian", 
    "Vepsian language", 
    "vep", 
    3260, 
    18, 
    9, 
    "The Veps language (also known as Vepsian, natively as vepsän kel’, vepsän keli, or vepsä), spoken by the Vepsians (also known as Veps), belongs to the Finnic group of the Uralic languages."
  ], 
  [
    "Ladino", 
    "Ladino language", 
    "lad", 
    3233, 
    39, 
    67, 
    "Judeo-Spanish (Judeo-Spanish: גֿודיאו-איספאנייול [dʒuˈðeo espaˈɲol]; Spanish: judeoespañol [xuˈðeo.espaˈɲol]), in Israel commonly referred to as Ladino, and known locally as Judezmo, Espanyol, Judeo-Espanyol, Spaniolit and other names, is a Romance language derived from Old Spanish."
  ], 
  [
    "Ligurian", 
    "Ligurian language", 
    "lij", 
    3150, 
    28, 
    75, 
    null
  ], 
  [
    "Wu", 
    "Wu language", 
    "wuu", 
    3140, 
    38, 
    107, 
    "Wu (simplified Chinese: 吴语; traditional Chinese: 吳語; pinyin: Wú yǔ, Suzhou Wu:  [ŋ˨˦ ɲy˧˩]) is a grouping of linguistically similar and historically related varieties of spoken Chinese also known as a dialect family."
  ], 
  [
    "Friulian", 
    "Friulian language", 
    "fur", 
    3067, 
    20, 
    33, 
    "Friulan ( furlan (help·info) or affectionately marilenghe in Friulan, friulano in Italian, furlanisch in German, furlanščina in Slovene; also Friulian), is a Romance language belonging to the Rhaeto-Romance family, spoken in the Friuli region of northeastern Italy."
  ], 
  [
    "Classical Chinese", 
    "Classical Chinese language", 
    "zh-classical", 
    2980, 
    44, 
    0, 
    "Classical Chinese (古文, Pinyin: gǔ wén, \"ancient text\") is the language of the classic literature from the Spring and Autumn period through to the end of the Han Dynasty, a written form of Old Chinese."
  ], 
  [
    "Uyghur", 
    "Uyghur language", 
    "ug", 
    2925, 
    26, 
    56, 
    "Uyghur /ˈwiːɡər/ (ئۇيغۇر تىلى, Uyghur tili), formerly known as Eastern Turki, is a Turkic language with 8 to 11 million speakers, spoken primarily by the Uyghur people in the Xinjiang Uyghur Autonomous Region of Western China."
  ], 
  [
    "Saterland Frisian", 
    "Saterland Frisian language", 
    "stq", 
    2918, 
    22, 
    41, 
    "Saterland Frisian, also known as Sater Frisian or Saterlandic (Seeltersk), is the last living dialect of the East Frisian language."
  ], 
  [
    "Sardinian", 
    "Sardinian language", 
    "sc", 
    2915, 
    28, 
    68, 
    "Sardinian (Sardinian: sardu, sadru, limba/lingua sarda, Italian: sardo, lingua sarda) or Sard is a Romance language spoken and written on most of the island of Sardinia (Italy)."
  ], 
  [
    "Aymara", 
    "Aymara language", 
    "ay", 
    2838, 
    23, 
    18, 
    "Aymara (Aymar aru) is an Aymaran language spoken by the Aymara people of the Andes."
  ], 
  [
    "Maltese", 
    "Maltese language", 
    "mt", 
    2818, 
    42, 
    248, 
    "Maltese (Malti) is the national language of Malta, and a co-official language of the country alongside English, while also serving as an official language of the European Union, the only Semitic language so distinguished."
  ], 
  [
    "Pali", 
    "Pali language", 
    "pi", 
    2807, 
    12, 
    6, 
    "Pali (also Pāḷi) is a Middle Indo-Aryan language that is in the Prakrit language group and was indigenous to the Indian subcontinent."
  ], 
  [
    "Somali", 
    "Somali language", 
    "so", 
    2760, 
    52, 
    69, 
    "The Somali language (Somali: Af-Soomaali, Arabic: اللغة الصومالية‎) is an Afro-Asiatic language, belonging to the family's Cushitic branch."
  ], 
  [
    "Bihari", 
    "Bihari language", 
    "bh", 
    2717, 
    13, 
    35, 
    "Bihari is a name given to the western group of Eastern Indic languages, spoken in Bihar and neighboring states in India."
  ], 
  [
    "Ripuarian", 
    "Ripuarian language", 
    "ksh", 
    2663, 
    24, 
    0, 
    "Ripuarian (also Ripuarian Franconian or Ripuarisch Platt; natively Ripoarėsch) is a German dialect group, part of the West Central German language group."
  ], 
  [
    "Novial", 
    "Novial language", 
    "nov", 
    2659, 
    18, 
    24, 
    "Novial [nov- (\"new\") + IAL, International Auxiliary Language] is a constructed international auxiliary language (IAL) for universal communication between speakers of different native languages."
  ], 
  [
    "Anglo-Saxon", 
    "Anglo-Saxon language", 
    "ang", 
    2528, 
    42, 
    221, 
    "Old English (Ænglisc, Anglisc, Englisc) or Anglo-Saxon is an early form of the English language that was spoken and written by the Anglo-Saxons and their descendants in parts of what are now England and southern and eastern Scotland between at least the mid-5th century and the mid-12th century."
  ], 
  [
    "Hakka", 
    "Hakka language", 
    "hak", 
    2494, 
    31, 
    21, 
    "Hakka /ˈhækə/, also rendered Kejia, is one of the major Chinese language subdivisions or varieties and is spoken natively by the Hakka people in southern China, Taiwan and throughout the diaspora areas of East Asia, Southeast Asia and around the world."
  ], 
  [
    "Cornish", 
    "Cornish language", 
    "kw", 
    2457, 
    23, 
    75, 
    "Cornish (Kernowek or Kernewek) is a Brythonic Celtic language historically spoken by the Cornish people."
  ], 
  [
    "Navajo", 
    "Navajo language", 
    "nv", 
    2426, 
    17, 
    204, 
    "Navajo or Navaho (Diné bizaad) is an Athabaskan language of Na-Dené stock spoken in the southwestern United States."
  ], 
  [
    "Picard", 
    "Picard language", 
    "pcd", 
    2422, 
    27, 
    16, 
    "Picard is a language (or a set of languages) closely related to French, and as such is one of the larger group of Romance languages."
  ], 
  [
    "Guarani", 
    "Guarani language", 
    "gn", 
    2341, 
    22, 
    46, 
    "Guaraní (pronounced /ˈɡwɑrəniː/ or /ɡwærəˈniː/), specifically the primary variety known as Paraguayan Guaraní (endonym avañe'ẽ [aʋãɲẽˈʔẽ] 'Ava language'), is an indigenous language of South America that belongs to the Tupí–Guaraní subfamily of the Tupian languages."
  ], 
  [
    "Extremaduran", 
    "Extremaduran language", 
    "ext", 
    2264, 
    22, 
    38, 
    "Extremaduran (autonym: estremeñu, IPA: [eʰtɾeˈmeɲu]) is a Romance language, spoken by several hundred thousand people in Spain, in an area covering the north-western part of the autonomous community of Extremadura and adjoining areas in the province of Salamanca."
  ], 
  [
    "Franco-Provençal/Arpitan", 
    "Franco-Provençal/Arpitan language", 
    "frp", 
    2248, 
    20, 
    58, 
    "Franco-Provençal (Francoprovençal), Arpitan, or Romand (in Switzerland) (Vernacular: francoprovençâl, arpetan, patoué; Italian: francoprovenzale, arpitano; French: francoprovençal, arpitan, patois) is a Gallo-Romance language spoken in east-central France, western Switzerland, and the Italian Aosta Valley."
  ], 
  [
    "Assamese", 
    "Assamese language", 
    "as", 
    2222, 
    48, 
    0, 
    "Assamese or Asamiya (অসমীয়া Ôxômiya) is an Eastern Indo-Aryan language used mainly in the state of Assam."
  ], 
  [
    "Silesian", 
    "Silesian language", 
    "szl", 
    2123, 
    23, 
    256, 
    "Silesian or Upper Silesian (Silesian: ślōnskŏ gŏdka, ślůnsko godka, Czech: slezský jazyk, Polish: język śląski) is a West Slavic lect, closely[citation needed] related to Polish and Czech."
  ], 
  [
    "Gagauz", 
    "Gagauz language", 
    "gag", 
    2091, 
    17, 
    20, 
    "The Gagauz language (Gagauz dili) is a Turkic language, spoken mainly by the Gagauz people and the official language of the autonomous Moldovan region of Gagauzia."
  ], 
  [
    "Emilian-Romagnol", 
    "Emilian-Romagnol language", 
    "eml", 
    2078, 
    26, 
    116, 
    "The Emiliano–Romagnolo (also known as Emilian-Romagnolo) language group is a genetic subgroup of the Gallo-Italic languages."
  ], 
  [
    "Interlingue", 
    "Interlingue language", 
    "ie", 
    2056, 
    22, 
    39, 
    "The language Occidental, later Interlingue, is a planned language created by the Balto-German naval officer and teacher Edgar de Wahl and published in 1922."
  ], 
  [
    "Lingala", 
    "Lingala language", 
    "ln", 
    2029, 
    21, 
    82, 
    "Lingala is a Bantu language spoken throughout the northwestern part of the Democratic Republic of the Congo and a large part of the Republic of the Congo, as well as to some degree in Angola and the Central African Republic."
  ], 
  [
    "Acehnese", 
    "Acehnese language", 
    "ace", 
    2011, 
    53, 
    43, 
    "Acehnese language (Achinese) is a Malayo-Polynesian language spoken by Acehnese people natively in Aceh, Sumatra, Indonesia."
  ], 
  [
    "Chechen", 
    "Chechen language", 
    "ce", 
    1997, 
    37, 
    103, 
    "The Chechen language (Нохчийн мотт / Noxc̈iyn mott / نوٓخچیین موٓتت (Arabic orthography before Latinisation); Medieval Chechen: نوًچین موت) is spoken by more than 1.3 million people, mostly in Chechnya and by Chechen people elsewhere."
  ], 
  [
    "Karachay-Balkar", 
    "Karachay-Balkar language", 
    "krc", 
    1881, 
    22, 
    209, 
    "The Karachay-Balkar language (Къарачай-Малкъар тил, Qaraçay-Malqar til or Таулу тил, Tawlu til) is a Turkic language spoken by the Karachays and Balkars."
  ], 
  [
    "Palatinate German", 
    "Palatinate German language", 
    "pfl", 
    1879, 
    24, 
    15, 
    "Palatine German or Pfaelzisch (Pälzisch; German: Pfälzisch) is a West Franconian dialect of German which is spoken in the Rhine Valley roughly in an area between the cities of Zweibrücken, Kaiserslautern, Alzey, Worms, Ludwigshafen am Rhein, Mannheim, Heidelberg, Speyer, Landau, Wörth am Rhein and the border to the Alsace region in France but also beyond."
  ], 
  [
    "Kalmyk", 
    "Kalmyk language", 
    "xal", 
    1872, 
    19, 
    95, 
    "Kalmyk Oirat, commonly known as the Kalmyk language (Kalmyk Oirat: Хальмг келн) is the native speech of the Kalmyk people of the Republic of Kalmykia, a federal subject of the Russian Federation."
  ], 
  [
    "Hawaiian", 
    "Hawaiian language", 
    "haw", 
    1865, 
    16, 
    28, 
    "The Hawaiian language (Hawaiian: ʻŌlelo Hawaiʻi) is a Polynesian language that takes its name from Hawaiʻi, the largest island in the tropical North Pacific archipelago where it developed."
  ], 
  [
    "Pennsylvania German", 
    "Pennsylvania German language", 
    "pdc", 
    1824, 
    22, 
    61, 
    "The Pennsylvania German language (usually referred to as the Pennsylvania Dutch language, or simply as Dutch, in American English[citation needed]; usually referred to in Pennsylvania German as Deitsch, Pennsylvania Deitsch or Pennsilfaanisch Deitsch) is a variety of West Central German possibly spoken by more than 250,000 people in North America."
  ], 
  [
    "Kinyarwanda", 
    "Kinyarwanda language", 
    "rw", 
    1818, 
    17, 
    42, 
    null
  ], 
  [
    "Crimean Tatar", 
    "Crimean Tatar language", 
    "crh", 
    1797, 
    21, 
    226, 
    "Crimean Tatar (Qırımtatarca, Qırımtatar tili, Къырымтатарджа, Къырымтатар тили) is the indigenous language of the Crimean Tatar peoples."
  ], 
  [
    "Tongan", 
    "Tongan language", 
    "to", 
    1647, 
    10, 
    39, 
    "Tongan /ˈtɒŋən/ (lea fakatonga) is an Austronesian language of the Polynesian branch spoken in Tonga."
  ], 
  [
    "Lower Sorbian", 
    "Lower Sorbian language", 
    "dsb", 
    1627, 
    22, 
    194, 
    "Lower Sorbian (Dolnoserbski) is a Slavic minority language spoken in eastern Germany in the historical province of Lower Lusatia, today part of Brandenburg."
  ], 
  [
    "Greenlandic", 
    "Greenlandic language", 
    "kl", 
    1595, 
    21, 
    53, 
    "Greenlandic[note 1] or Greenlandic Inuit language is an Eskimo–Aleut language spoken by about 57,000 Greenlandic Inuit people in Greenland."
  ], 
  [
    "Aramaic", 
    "Aramaic language", 
    "arc", 
    1579, 
    20, 
    120, 
    "Aramaic is a family of languages (traditionally referred to as \"dialects\") belonging to the Semitic family, and more specifically, is a part of the Northwest Semitic subfamily, which also includes Canaanite languages such as Hebrew and Phoenician."
  ], 
  [
    "Erzya", 
    "Erzya language", 
    "myv", 
    1547, 
    16, 
    42, 
    "The Erzya language (эрзянь кель) is spoken by about 700,000 people in the northern and eastern and north-western parts of the Republic of Mordovia and adjacent regions of Nizhniy Novgorod, Chuvashia, Penza, Samara, Saratov, Orenburg, Ulyanovsk, Tatarstan and Bashkortostan in Russia."
  ], 
  [
    "Kabyle", 
    "Kabyle language", 
    "kab", 
    1506, 
    24, 
    57, 
    "Kabyle /kəˈbaɪl/ or Kabylian /kəˈbaɪliən/ (Kabyle: Taqbaylit, [ˈθɐqβæjlɪθ] ( listen)) is a Berber language spoken by the Kabyle people in the north and northeast of Algeria."
  ], 
  [
    "Lezgian", 
    "Lezgian language", 
    "lez", 
    1492, 
    22, 
    32, 
    "Lezgian /ˈlɛzɡiən/, also called Lezgi or Lezgin, is a language that belongs to the Lezgic languages."
  ], 
  [
    "Banjar", 
    "Banjar language", 
    "bjn", 
    1441, 
    22, 
    122, 
    "Banjar language is the native language used by the Banjarese people of South Kalimantan, Indonesia."
  ], 
  [
    "Shona", 
    "Shona language", 
    "sn", 
    1421, 
    15, 
    23, 
    "Shona /ˈʃoʊnə/, or chiShona, is a Bantu language, native to the Shona people of Zimbabwe and southern Zambia; the term is also used to identify peoples who speak one of the Shona language dialects: Zezuru, Karanga, Manyika, Ndau and Korekore. (Some researchers include Kalanga: others recognise Kalanga as a distinct language in its own right.) Shona is a principal language of Zimbabwe, along with Ndebele and the official business language, English."
  ], 
  [
    "Papiamentu", 
    "Papiamentu language", 
    "pap", 
    1328, 
    26, 
    51, 
    "Papiamento /pæpjəˈmɛntoʊ/ (or Papiamentu) is the most widely spoken language on the Caribbean ABC islands, having official status on the islands of Aruba and Curaçao."
  ], 
  [
    "Tok Pisin", 
    "Tok Pisin language", 
    "tpi", 
    1236, 
    23, 
    192, 
    "Tok Pisin (English pron.: /tɒk ˈpɪsɪn/; Tok Pisin [ˌtokpiˈsin]) is a creole spoken throughout Papua New Guinea."
  ], 
  [
    "Lak", 
    "Lak language", 
    "lbe", 
    1191, 
    16, 
    142, 
    "The Lak language (лакку маз, lakːu maz) is a Northeast Caucasian language forming its own branch within this family."
  ], 
  [
    "Wolof", 
    "Wolof language", 
    "wo", 
    1161, 
    15, 
    241, 
    "Wolof /ˈwɒlɒf/ is a language of Senegal, the Gambia, and Mauritania, and the native language of the Wolof people."
  ], 
  [
    "Lojban", 
    "Lojban language", 
    "jbo", 
    1155, 
    19, 
    319, 
    "Lojban (pronounced locally: [ˈloʒban] ( listen)) is a constructed, syntactically unambiguous human language based on predicate logic, succeeding the project of Loglan."
  ], 
  [
    "Moksha", 
    "Moksha language", 
    "mdf", 
    1144, 
    12, 
    69, 
    "The Moksha language (Moksha: мокшень кяль) is a member of the Mordvinic branch of the Uralic languages with about 600,000 native speakers."
  ], 
  [
    "Zamboanga Chavacano", 
    "Zamboanga Chavacano language", 
    "cbk-zam", 
    1120, 
    20, 
    77, 
    "Chavacano or Chabacano [tʃaβaˈkano] is a Spanish-based creole language spoken in the Philippines."
  ], 
  [
    "Avar", 
    "Avar language", 
    "av", 
    1094, 
    21, 
    122, 
    "The modern Avar language (self-designation магӀарул мацӀ maharul macʼ [maʕarul mat͡sʼ] \"language of the mountains\" or Авар мацI awar macʼ [awar mat͡sʼ] \"Avar language\") belongs to the Avar–Andic group of the Northeast Caucasian language family."
  ], 
  [
    "Kabardian Circassian", 
    "Kabardian Circassian language", 
    "kbd", 
    1055, 
    21, 
    36, 
    "Kabardian /kəˈbɑrdiən/ (Kabardian: адыгэбзэ adəgăbză or къэбэрдеибзэ  qabardejbza (help·info)), also known as East Circassian, is a Northwest Caucasian language, closely related to the Adyghe language."
  ], 
  [
    "Sranan", 
    "Sranan language", 
    "srn", 
    1034, 
    12, 
    29, 
    "Sranan (also Sranan Tongo or Sranantongo \"Surinamean tongue\", Surinaams, Surinamese, Suriname Creole, Taki Taki) is a creole language spoken as a lingua franca by approximately 300,000 people in Suriname."
  ], 
  [
    "Mirandese", 
    "Mirandese language", 
    "mwl", 
    1012, 
    28, 
    270, 
    "The Mirandese language (autonym: mirandés or lhéngua mirandesa; Portuguese: mirandês or língua mirandesa) is a Romance language belonging to the Astur-Leonese linguistic group, sparsely spoken in a small area of northeastern Portugal, in the municipalities of Miranda do Douro, Mogadouro and Vimioso."
  ], 
  [
    "Tahitian", 
    "Tahitian language", 
    "ty", 
    886, 
    12, 
    91, 
    "Tahitian (Reo Mā'ohi or Reo Tahiti in Tahitian) is an indigenous language spoken mainly in the Society Islands in French Polynesia."
  ], 
  [
    "Lao", 
    "Lao language", 
    "lo", 
    848, 
    20, 
    210, 
    "Lao or Laotian /ˈlaʊʃən/ (ພາສາລາວ, BGN/PCGN: phasa lao, IPA: [pʰáːsǎː láːw]) is a tonal language of the Tai–Kadai language family."
  ], 
  [
    "Abkhazian", 
    "Abkhazian language", 
    "ab", 
    807, 
    24, 
    163, 
    "Abkhaz (Abxaz) /æpˈhɑːz/ (Abkhaz: Аҧсуа бызшәа; Adyghe: Азгъэбзэ) is a Northwest Caucasian language spoken mostly by the Abkhaz people."
  ], 
  [
    "Tetum", 
    "Tetum language", 
    "tet", 
    773, 
    15, 
    77, 
    "Tetum /ˈtɛtʊm/ (also Tetun) is an Austronesian language spoken on the island of Timor."
  ], 
  [
    "Latgalian", 
    "Latgalian language", 
    "ltg", 
    758, 
    8, 
    61, 
    null
  ], 
  [
    "Kongo", 
    "Kongo language", 
    "kg", 
    742, 
    17, 
    64, 
    "The Kongo language, or Kikongo, is the Bantu language spoken by the Bakongo and Bandundu people living in the tropical forests of the Democratic Republic of the Congo, the Republic of the Congo and Angola."
  ], 
  [
    "Nauruan", 
    "Nauruan language", 
    "na", 
    731, 
    18, 
    384, 
    "The Nauruan language (dorerin Naoero) is an Austronesian language spoken in Nauru."
  ], 
  [
    "Igbo", 
    "Igbo language", 
    "ig", 
    723, 
    15, 
    264, 
    "Igbo /ˈɪɡboʊ/,(archaically Ibo /ˈiːboʊ/) (Igbo: Asụsụ Igbo), is the principal native language of the Igbo people, an ethnic group of southeastern Nigeria."
  ], 
  [
    "Buryat (Russia)", 
    "Buryat (Russia) language", 
    "bxr", 
    699, 
    18, 
    175, 
    "Buryat (Buriat) /ˈbʊriæt/ (Buryat Cyrillic: буряад хэлэн buryaad khelen) is a variety of Mongolic spoken by the Buryats that is classified either as a language or as a major dialect group of Mongolian."
  ], 
  [
    "Northern Sotho", 
    "Northern Sotho language", 
    "nso", 
    687, 
    10, 
    17, 
    "Northern Sotho is a designation in English, rendered officially and among indigenous speakers as Sesotho sa Leboa."
  ], 
  [
    "Zhuang", 
    "Zhuang language", 
    "za", 
    663, 
    19, 
    68, 
    "The Zhuang languages (autonym: Vahcuengh (pre-1982: Vaƅcueŋƅ, Sawndip: 话壮), from vah 'language' and Cuengh 'Zhuang'; simplified Chinese: 壮语; traditional Chinese: 壯語; pinyin: Zhuàngyǔ) are any of various Tai languages natively spoken by the Zhuang people."
  ], 
  [
    "Karakalpak", 
    "Karakalpak language", 
    "kaa", 
    621, 
    19, 
    118, 
    "Karakalpak is a Turkic language mainly spoken by Karakalpaks in Karakalpakstan (Uzbekistan), as well as by Bashkirs and Nogay."
  ], 
  [
    "Zulu", 
    "Zulu language", 
    "zu", 
    583, 
    27, 
    233, 
    "Zulu (isiZulu in Zulu and South African English) is the language of the Zulu people with about 10 million speakers, the vast majority (over 95%) of whom live in South Africa."
  ], 
  [
    "Cheyenne", 
    "Cheyenne language", 
    "chy", 
    561, 
    17, 
    58, 
    "The Cheyenne language (Tsėhesenėstsestotse or, in easier spelling, Tsisinstsistots) is a Native American language spoken by the Cheyenne people, predominantly in present-day Montana and Oklahoma in the United States."
  ], 
  [
    "Romani", 
    "Romani language", 
    "rmy", 
    541, 
    15, 
    223, 
    "Romani /ˈroʊməni/ (also Romany, Gypsy, or Gipsy; Romani: romani ćhib) is any of several languages of the Romani people belonging to the Indo-Aryan branch of the Indo-European language family."
  ], 
  [
    "Aromanian", 
    "Aromanian language", 
    "roa-rup", 
    511, 
    23, 
    0, 
    "Aromanian (limba armãneascã, armãneshce, armãneashti, rrămăneshti), also known as Macedo-Aromanian or Vlach, is an Eastern Romance language spoken in Southeastern Europe."
  ], 
  [
    "Old Church Slavonic", 
    "Old Church Slavonic language", 
    "cu", 
    511, 
    19, 
    0, 
    "Old Church Slavonic, also known as Old Church Slavic (often abbreviated to OCS; self-name словѣ́ньскъ ѩзꙑ́къ, slověnĭskŭ językŭ) was the first Slavic literary language."
  ], 
  [
    "Tswana", 
    "Tswana language", 
    "tn", 
    495, 
    14, 
    86, 
    "Tswana or Setswana is a language spoken in Southern Africa by about 4.5 million people."
  ], 
  [
    "Cherokee", 
    "Cherokee language", 
    "chr", 
    472, 
    27, 
    381, 
    "Cherokee (ᏣᎳᎩ ᎦᏬᏂᎯᏍᏗ Tsalagi Gawonihisdi) is the Iroquoian language spoken by the Cherokee people."
  ], 
  [
    "Bislama", 
    "Bislama language", 
    "bi", 
    451, 
    20, 
    154, 
    "Bislama (English /ˈbɪsləmɑː/; Bislama: [bislaˈma]) is a creole language, one of the official languages of Vanuatu."
  ], 
  [
    "Min Dong", 
    "Min Dong language", 
    "cdo", 
    438, 
    17, 
    369, 
    "Eastern Min, or Min Dong (simplified Chinese: 闽东语; traditional Chinese: 閩東語; pinyin: Mǐndōngyǔ; Foochow Romanized: Mìng-dĕ̤ng-ngṳ̄), is the language mainly spoken in the eastern part of Fujian Province in China, in and near Fuzhou and Ningde."
  ], 
  [
    "Gothic", 
    "Gothic language", 
    "got", 
    431, 
    13, 
    404, 
    "Gothic is an extinct Germanic language that was spoken by the Goths."
  ], 
  [
    "Samoan", 
    "Samoan language", 
    "sm", 
    428, 
    15, 
    354, 
    "Samoan (Gagana fa'a Sāmoa or Gagana Sāmoa — IPA: [ŋaˈŋana ˈsaːmʊa]) is the language of the Samoan Islands, comprising the independent country of Samoa and the United States territory of American Samoa."
  ], 
  [
    "Moldovan", 
    "Moldovan language", 
    "mo", 
    401, 
    0, 
    100, 
    "Moldovan (also Moldavian; limba moldovenească, or лимба молдовеняскэ in Moldovan Cyrillic) is the official name of the Romanian language in the Republic of Moldova."
  ], 
  [
    "Bambara", 
    "Bambara language", 
    "bm", 
    393, 
    15, 
    469, 
    "Bambara, also known as Bamana, and Bamanankan by speakers of the language, is a language spoken in Mali, and to a lesser extent Burkina Faso and Senegal, by as many as six million people (including second language users)."
  ], 
  [
    "Inuktitut", 
    "Inuktitut language", 
    "iu", 
    388, 
    17, 
    0, 
    "Inuktitut (Inuktitut syllabics: ᐃᓄᒃᑎᑐᑦ) [i.nuk.ti.'tut] or Eastern Canadian Inuktitut, Eastern Canadian Inuit language is the name of some of the Inuit languages spoken in Canada."
  ], 
  [
    "Norfolk", 
    "Norfolk language", 
    "pih", 
    382, 
    13, 
    225, 
    "Norfuk (increasingly spelt Norfolk) or Norf’k is the language spoken on Norfolk Island by the local residents."
  ], 
  [
    "Pontic", 
    "Pontic language", 
    "pnt", 
    374, 
    13, 
    243, 
    "Pontic Greek (Greek: Ποντιακή διάλεκτος or Ποντιακά) is a Greek language originally spoken in the Pontus area on the southern shores of the Black Sea, northeastern Anatolia, Eastern Turkish/Caucasus province of Kars, southern Georgia, and today mainly in northern Greece."
  ], 
  [
    "Sindhi", 
    "Sindhi language", 
    "sd", 
    364, 
    12, 
    0, 
    "Sindhi /ˈsɪndi/ (Sindhi: سنڌي) is the language of the historical Sindh region, spoken by the Sindhi people."
  ], 
  [
    "Swati", 
    "Swati language", 
    "ss", 
    364, 
    16, 
    271, 
    "The Swazi or Swati language (Swazi: siSwati [siswatʼi]; Zulu: isiSwazi [isiswaz̤i]) is a Bantu language of the Nguni group spoken in Swaziland and South Africa by the Swazi people."
  ], 
  [
    "Kikuyu", 
    "Kikuyu language", 
    "ki", 
    342, 
    13, 
    136, 
    "Gikuyu or Kikuyu (Gikuyu: Gĩkũyũ, pronounced [ɣēkōjó]) is a language of the Bantu family spoken primarily by the Kikuyu people of Kenya."
  ], 
  [
    "Ewe", 
    "Ewe language", 
    "ee", 
    300, 
    16, 
    0, 
    "Ewe (Èʋe or Èʋegbe [èβeɡ͡be]) is a Niger–Congo language spoken in southeastern Ghana and southern Togo by over three million people."
  ], 
  [
    "Hausa", 
    "Hausa language", 
    "ha", 
    289, 
    16, 
    370, 
    "Hausa /ˈhaʊsə/ (Yaren Hausa) is the Chadic language (a branch of the Afro-Asiatic language family) with the largest number of speakers, spoken as a first language by about 34 million people, and as a second language by about 18 million more, an approximate total of 52 million people."
  ], 
  [
    "Oromo", 
    "Oromo language", 
    "om", 
    275, 
    16, 
    0, 
    "Oromo /ˈɒrəmoʊ/ is an Afro-Asiatic language."
  ], 
  [
    "Fijian", 
    "Fijian language", 
    "fj", 
    272, 
    20, 
    474, 
    "Fijian is an Austronesian language of the Malayo-Polynesian family spoken in Fiji."
  ], 
  [
    "Tigrinya", 
    "Tigrinya language", 
    "ti", 
    258, 
    18, 
    224, 
    "Tigrinya /tɪˈɡriːnjə/ (ትግርኛ, tigriñā) is a Semitic language spoken in Eritrea by the Tigrinya people and in the Tigray Region of Ethiopia (its speakers there are called \"Tigrawot, Tegaru\"), and among groups of emigrants from these regions, including some of the Beta Israel now living in Israel."
  ], 
  [
    "Tsonga", 
    "Tsonga language", 
    "ts", 
    240, 
    14, 
    0, 
    "The Tsonga language (Xitsonga), or more precisely Changana, is a southern African Bantu language spoken by the Tsonga people."
  ], 
  [
    "Kashmiri", 
    "Kashmiri language", 
    "ks", 
    227, 
    14, 
    0, 
    "Kashmiri /kæʃˈmɪəri/ (कॉशुर, کأشُر Koshur) is a language from the Dardic sub-group of the Indo-Aryan languages and it is spoken primarily in the Kashmir Valley, in Jammu and Kashmir."
  ], 
  [
    "Venda", 
    "Venda language", 
    "ve", 
    204, 
    15, 
    347, 
    "Venda, also known as Tshivenḓa or Luvenḓa, is a Bantu language and an official language of South Africa."
  ], 
  [
    "Sango", 
    "Sango language", 
    "sg", 
    195, 
    11, 
    0, 
    "Sango (also spelled Sangho) is the primary language spoken in the Central African Republic: it had approximately 1,600,000 to 5,000,000 second-language speakers as of the early 1970s, but only about 404,000 native speakers, mainly in the towns."
  ], 
  [
    "Kirundi", 
    "Kirundi language", 
    "rn", 
    190, 
    16, 
    415, 
    "Kirundi, also known as Rundi, is a dialect of the Rwanda-Rundi language spoken by nine million people in Burundi and adjacent parts of Tanzania and Congo-Kinshasa, as well as in Uganda."
  ], 
  [
    "Sesotho", 
    "Sesotho language", 
    "st", 
    189, 
    11, 
    0, 
    "The Sotho /ˈsuːtuː/ language, also known as Sesotho, Southern Sotho, or Southern Sesotho, is a Bantu language spoken primarily in South Africa, where it is one of the 11 official languages, and in Lesotho, where it is the national language."
  ], 
  [
    "Dzongkha", 
    "Dzongkha language", 
    "dz", 
    179, 
    15, 
    0, 
    "Dzongkha (རྫོང་ཁ་; Wylie: rdzong-kha, Jong-kă), occasionally Ngalopkha, is the national language of Bhutan."
  ], 
  [
    "Akan", 
    "Akan language", 
    "ak", 
    176, 
    19, 
    0, 
    "Akan /əˈkæn/, also known as Twi [tɕɥi] and Fante, is an Akan language that is the principal native language of Akan lands in Ghana, spoken over much of the southern half of that country, by about 58% of the population, and among 30% of the population of Ivory Coast."
  ], 
  [
    "Cree", 
    "Cree language", 
    "cr", 
    170, 
    18, 
    0, 
    "Cree /ˈkriː/ (also known as Cree–Montagnais–Naskapi) is an Algonquian language spoken by approximately 117,000 people across Canada, from the Northwest Territories and Alberta to Labrador, making it the aboriginal language with the highest number of speakers in Canada."
  ], 
  [
    "Tumbuka", 
    "Tumbuka language", 
    "tum", 
    167, 
    14, 
    0, 
    "The Tumbuka language is a Bantu language which is spoken in parts of Malawi, Zambia, and Tanzania."
  ], 
  [
    "Luganda", 
    "Luganda language", 
    "lg", 
    166, 
    14, 
    0, 
    "The Ganda /ˈɡændə/ language, or Luganda (Ganda: Oluganda [oluɡaːnda][missing tone]), is the major language of Uganda, spoken by over sixteen million Ganda and other people mainly in Southern Uganda, including the capital Kampala."
  ], 
  [
    "Inupiak", 
    "Inupiak language", 
    "ik", 
    164, 
    14, 
    0, 
    "The Inupiat language[pronunciation?], also known as Inupiatun, Inupiaq, Iñupiaq, Inyupiaq, Inyupiat, Inyupeat, Inyupik, and Inupik, is a group of dialects of the Inuit language, spoken in northern and northwestern Alaska."
  ], 
  [
    "Fula", 
    "Fula language", 
    "ff", 
    164, 
    16, 
    0, 
    "The Fula /ˈfuːlə/ language, also known as Fulani /fʊˈlɑːniː/ (Fula: Fulfulde, Pulaar, Pular; French: Peul) is a language of West Africa."
  ], 
  [
    "Chichewa", 
    "Chichewa language", 
    "ny", 
    164, 
    13, 
    0, 
    "Chewa, also known as Nyanja, is a language of the Bantu language family."
  ], 
  [
    "Twi", 
    "Twi language", 
    "tw", 
    158, 
    17, 
    461, 
    "Akan /əˈkæn/, also known as Twi [tɕɥi] and Fante, is an Akan language that is the principal native language of Akan lands in Ghana, spoken over much of the southern half of that country, by about 58% of the population, and among 30% of the population of Ivory Coast."
  ], 
  [
    "Chamorro", 
    "Chamorro language", 
    "ch", 
    157, 
    18, 
    0, 
    "Chamorro (Chamorro: Fino' Chamoru or simply Chamoru) is a Malayo-Polynesian language (Austronesian), with much Spanish influence, spoken by about 47,000 people (about 35,000 people on Guam and about 12,000 in the Northern Mariana Islands)."
  ], 
  [
    "Xhosa", 
    "Xhosa language", 
    "xh", 
    148, 
    18, 
    0, 
    "Xhosa /ˈkoʊsə/ (Xhosa: isiXhosa [isikǁʰóːsa]) is one of the official languages of South Africa."
  ], 
  [
    "Ndonga", 
    "Ndonga language", 
    "ng", 
    21, 
    0, 
    0, 
    "Ndonga, also called OshiNdonga, is a Bantu language spoken in Namibia and some parts of Angola."
  ], 
  [
    "Sichuan Yi", 
    "Sichuan Yi language", 
    "ii", 
    16, 
    0, 
    0, 
    "Nuosu (Nosu), also known as Northern Yi, Liangshan Yi, and Sichuan Yi, is the prestige language of the Yi people; it has been chosen by the Chinese government as the standard Yi language (in Mandarin: Yí yǔ, 彝語/彝语) and, as such, is the only one taught in school, both in its oral and written form."
  ], 
  [
    "Choctaw", 
    "Choctaw language", 
    "cho", 
    15, 
    0, 
    0, 
    "The Choctaw language, traditionally spoken by the Native American Choctaw people of the southeastern United States, is a member of the Muskogean family."
  ], 
  [
    "Marshallese", 
    "Marshallese language", 
    "mh", 
    10, 
    0, 
    0, 
    "The Marshallese language (Marshallese: new orthography Kajin M̧ajeļ or old orthography Kajin Majōl, [kɑ͡æzʲinʲ(e͡ɤ) mˠɑɑ̯zʲɛ͡ʌɫ]), also known as Ebon, is a Malayo-Polynesian language spoken in the Marshall Islands by about 44,000 people, and the principal language of the country."
  ], 
  [
    "Afar", 
    "Afar language", 
    "aa", 
    6, 
    0, 
    0, 
    "Afar (Qafár af) is a Lowland East Cushitic language spoken in Ethiopia, Eritrea and Djibouti."
  ], 
  [
    "Kuanyama", 
    "Kuanyama language", 
    "kj", 
    5, 
    0, 
    0, 
    "Kwanyama or Oshikwanyama is a national language of Angola and Namibia."
  ], 
  [
    "Hiri Motu", 
    "Hiri Motu language", 
    "ho", 
    3, 
    0, 
    0, 
    "Hiri Motu, (also known as Police Motu or Pidgin Motu) is an official language of Papua New Guinea."
  ], 
  [
    "Muscogee", 
    "Muscogee language", 
    "mus", 
    2, 
    0, 
    0, 
    "The Muscogee language (Mvskoke in Muscogee), also known as Creek, Seminole, Creek-Seminole, or Muskogee, is a Muskogean language spoken by Muscogee (Creek) and Seminole people, primarily in the U."
  ], 
  [
    "Kanuri", 
    "Kanuri language", 
    "kr", 
    1, 
    0, 
    0, 
    "Kanuri /kəˈnuːri/ is a dialect continuum spoken by some four million people, as of 1987, in Nigeria, Niger, Chad and Cameroon, as well as small minorities in southern Libya and by a diaspora in Sudan."
  ], 
  [
    "Herero", 
    "Herero language", 
    "hz", 
    0, 
    0, 
    0, 
    "The Herero language (Otjiherero) is a language of the Bantu family (Niger–Congo group)."
  ]
]